# Brewfile

cask_args appdir: '/Applications'

# Install and manage GUI macOS applications
tap 'homebrew/cask'
# Alternate versions of Casks
tap 'homebrew/cask-versions'
# Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'homebrew/services'
# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap 'buo/cask-upgrade'

tap "homebrew/bundle"

tap "homebrew/core"

### System {{{
  ## System Libraries
  # Manage compile and link flags for libraries
  brew 'pkg-config', link: true
  # Text-based UI library
  brew 'ncurses'
  # GNU internationalization (i18n) and localization (l10n) library
  brew 'gettext'
  # Library for command-line editing
  brew 'readline'
  # Core application library for C
  brew 'glib'
  # GNU Transport Layer Security (TLS) Library
  brew 'gnutls'
  # Vector graphics library with cross-device output support
  brew 'cairo'
  # Framework for layout and rendering of i18n text
  brew 'pango'
  # Image manipulation library
  brew 'jpeg'
  # Library for manipulating PNG images
  brew 'libpng'
  # TIFF library and utilities
  brew 'libtiff'
  # Software library to render fonts
  brew 'freetype'
  # Generic library support script
  # INFO: In order to prevent conflicts with Apple's own libtool we have prepended a "g"
  brew 'libtool'
  # SSL/TLS cryptography library
  brew 'openssl'
  #
  brew 'zlib'

  ## Monitoring
  # An interactive process viewer for Unix
  brew 'htop'
  # Display an interface's bandwidth usage
  brew 'iftop'
  # Top-like interface for container metrics
  brew 'ctop'
  # macOS system monitor in your menu bar
  cask 'stats'

  ## Mac OS X
  # Homebrew GUI App for OS X
  cask 'cakebrew'
  # Mac App Store command line interface
  brew 'mas'
  # Swiss Army Knife for macOS
  brew 'm-cli'

  ## Mac OS X: Quick Look Plugins
  # View plain text files without a file extension
  # cask 'qlstephen'
  # Preview source code files with syntax highlighting
  cask 'qlcolorcode'
### }}}


### Terminal {{{
  ## Terminal Emulator
  # Terminal Emulator for macOS
  cask 'iterm2'

  #
  brew 'MisterTea/et/et'

  ## Terminal Multiplexer
  # Terminal multiplexer with VT100/ANSI terminal emulation
  brew 'screen'
  # A terminal multiplexer, allowing to access multiple separate terminal sessions
  brew 'tmux'
  # Reattach process (e.g., tmux) to background
  brew 'reattach-to-user-namespace'

  ## Shell: Bash
  # Bourne-Again SHell, a UNIX command interpreter
  brew 'bash'
  # Programmable completion for Bash 4.1+
  brew 'bash-completion@2'

  ## Shell: Fish
  # User-friendly command-line shell for UNIX-like operating systems
  # INFO: Need to add `/usr/local/bin/fish` to `/etc/shells`
  brew 'fish'

  brew 'stow'

  brew 'the_silver_searcher'
#}}}


### Utility {{{
  # GNU File, Shell, and Text utilities
  brew 'coreutils'
  # Internet file retriever
  brew 'wget'
  # GNU awk utiliy
  brew 'gawk'

  ## Compress/Uncompress
  # 7-Zip (high compression file archiver) implementation
  brew 'p7zip'
  # General-purpose data compression with high compression ratio
  brew 'xz'

  # Display directories as trees
  brew 'tree'
  # Executes a program periodically, showing output fullscreen
  brew 'watch'
  # Simplified and community-driven man pages
  brew 'tldr'
  # Modern replacement for `ls`
  brew 'exa'
  # Clone of cat with syntax highlighting and Git integration
  brew 'bat'
  # Simple, fast and user-friendly alternative to find
  brew 'fd'
  # Yet another cross-platform graphical process/system monitor.
  tap 'clementtsang/bottom'
  brew 'bottom'
### }}}


### Web {{{
  ## Web Browser
  cask 'google-chrome'
  cask 'firefox-developer-edition'

  ## Flash Player for Web Browser
  # Adobe Flash Player NPAPI (plugin for Safari and Firefox)
  # cask 'flash-npapi'
  # Adobe Flash Player PPAPI (plugin for Opera and Chromium)
  # cask 'flash-ppapi'
### }}}


### Messaging {{{
  # Team communication and collaboration software
#   mas 'Slack', id: 803453959
  # Messaging app with a focus on speed and security
  cask 'telegram'
### }}}


### Image {{{
  ## Utility
  # Perl lib for reading and writing EXIF metadata
  brew 'exiftool'

  # collection of libraries and tools to process multimedia content
  brew 'ffmpeg'

  # Convert, Edit, or Compose Digital Images
  brew 'imagemagick'

  cask 'gimp'
### }}}


### Video {{{
  ## Player
  # VLC media player
  cask 'vlc'
### }}}


### Keyboard & Mouse {{{
  # Network KVM Switch(Mouse and Keyboard Sharing)
#   cask 'synergy'
  # Customize various input devices on your Mac
#   cask 'bettertouchtool'
  # Know your short cuts
  cask 'cheatsheet'
  # A powerful and stable keyboard customizer for macOS
#   cask 'karabiner-elements'
### }}}


### Device {{{
  ## Android
  # Android SDK Platform-Tools
#   cask 'android-platform-tools'
  # Android File Transfer
  cask 'android-file-transfer'
### }}}


### File System {{{
  ## Cloud
#   cask 'google-drive-file-stream'

  ## Recovery
  # Console program to recover files based on their headers and footers
#   brew 'foremost'

  # A simple, fast and user-friendly alternative to 'find'
  brew 'fd'

  # Like du but more intuitive.
  brew 'dust'

  brew 'fzf'
### }}}


### Cryptography {{{
  # Enhanced version of john, a UNIX password cracker
#   brew 'john-jumbo'
  # Suite of barcodes-reading tools
#   brew 'zbar'

  ## PGP(Pretty Good Privacy)
  # GNU Pretty Good Privacy (PGP) package
  brew 'gnupg'
  # Pinentry for GPG on Mac
#   brew 'pinentry-mac'
  # Custom GPG pinentry program for macOS that allows using Touch ID
#   tap 'jorgelbg/tap'
#   brew 'pinentry-touchid'

  # Free security app for mobile phones and computers
  # Digital signature manager
#   cask 'keybase'
  # A password manager, digital vault, form filler and secure digital wallet
#   cask '1password'
  # The slightly more awesome standard unix password manager for teams
  brew 'gopass'

  # Bitwarden password manager, which is open-source
  cask 'bitwarden'
### }}}


### Game {{{
  ## Emulator
#   cask 'openemu'
### }}}
