# vi: filetype=brewfile
# Brewfile.dev-base

cask_args appdir: '/Applications'

### Development {{{
  # Automatic configure script builder
  brew 'autoconf'
  # Tool for generating GNU Standards-compliant Makefiles
  brew 'automake'
  # Cross-platform make
  brew 'cmake'
  # GNU debugger
  brew 'gdb'

  # GNOME XML library
  brew 'libxml2'
### }}}


### Code Editor & IDE {{{
  ## Editor: Vim
  # Vi 'workalike' with many additional features
  brew 'vim'
  # Ambitious Vim-fork focused on extensibility and agility
  brew 'neovim'

  ## Editor: Microsoft Visual Studio Code
  cask 'visual-studio-code'
### }}}


### VCS {{{
  ## Git & GitHub
  # Distributed revision control system
  brew 'git'
  # Git extension for versioning large files
  brew 'git-lfs'
  # Small git utilities
  brew 'git-extras'
  # Extensions to follow Vincent Driessen's branching model
  brew 'git-flow'
  # Prevents you from committing sensitive information to a git repo
  brew 'git-secrets'
  # Secure, cross-platform Git credential storage with authentication to GitHub, Azure Repos, and other popular Git hosting services.
  tap 'microsoft/git'
  brew 'git-credential-manager-core'
  # Remove crazy big files, passwords, credentials and other private data
  brew 'bfg'
  # GitHub command-line tool
  brew 'gh'
  # A framework for managing and maintaining multi-language pre-commit hooks
  brew 'pre-commit'
  # A syntax-highlighting pager for git, diff, and grep output
  brew "git-delta"
### }}}


### Network {{{
  ## Analysis
  # The world’s foremost and widely-used network protocol analyzer
  cask 'wireshark'
  # Port scanning utility for large networks
  brew 'nmap'

  ## Proxy & VPN

  # For an instant, secure URL to your localhost server through any NAT or firewall
  cask 'ngrok'

  ## Utility

### }}}


### Web {{{
  ## HTTP Request
  # Powerful HTTP and GraphQL tool belt
  cask 'insomnia'
  # User-friendly cURL replacement (command-line HTTP client)
  brew 'httpie'

  brew 'hugo'

  cask 'postman'
### }}}


### Programming Language {{{
  ## Node.js
  # Platform built on V8 to build network applications
  brew 'node'
  brew 'nvm'
  brew 'yarn'

  ## Python
  # Python3
  brew 'python'
  # Python dependency management tool
  brew 'pipenv'

  ## Golang
  # Open source programming language to build simple/reliable/efficient software
  brew 'go'
  # Go cross compile tool
  brew 'gox'

  ## C Family
  # GNU compiler collection
  brew 'gcc'

  ## Java
  # Java Standard Edition Development Kit 12
  # INFO: Need to reboot
  brew 'java'
  # An open and reproducible build & test system for OpenJDK
  # INFO: Need to install OpenJDK 8
  cask 'adoptopenjdk8'
  # Java build tool
  brew 'ant'
  # Java-based project management
  brew 'maven'
  # Open-source build automation tool based on the Groovy and Kotlin DSL
  brew 'gradle'

  ## Ruby
  # Powerful, clean, object-oriented scripting language
  brew 'ruby'
  # Ruby version manager
  brew 'rbenv'
  # Compile and install Ruby for rbenv
  brew 'ruby-build'

  ## Shellscript
  # Static analysis and lint tool, for (ba)sh scripts
  brew 'shellcheck'

  ## Lua
  # Powerful, lightweight programming language
  brew 'lua'
  # Just-In-Time Compiler (JIT) for the Lua programming language
  brew 'luajit'
  # Package manager for the Lua programming language
  brew 'luarocks'

  ## YAML
  # Linter for YAML files
  brew 'yamllint'

  "" JSON
  brew 'jq'
### }}}


### Virtualization {{{
  ## Virtual Machine
  # Oracle VirtualBox
  # INFO: Need to enable their kernel extension
  cask 'virtualbox'

  ## Container
  # The lazier way to manage everything docker
  brew 'lazydocker'

  # macOS Credential Helper for Docker
  brew "docker-credential-helper"

  ## Kubernetes
  # Kubernetes command-line interface
  brew 'kubernetes-cli'
  # Plugin manager for kubectl command-line tool
  brew 'krew'
  # The Kubernetes package manager
  brew 'kubernetes-helm'
  # Customization of kubernetes YAML configurations
  brew 'kustomize'
  # Tool that can switch between kubectl contexts easily and create aliases
  brew 'kubectx'
  # Kubernetes CLI to manage cluters in style
  brew 'k9s'
  # Tool for repeatable Kubernetes development
  brew 'skaffold'
  # Kubernetes log viewer
  tap 'boz/repo'
  brew 'kail'
  # Bulk port forwarding Kubernetes services for local development
  tap 'txn2/tap'
  brew 'kubefwd'

  cask 'lens'
### }}}


### Database {{{
  ## SQL
  # SQLite
  brew 'sqlite'
  # MySQL
  brew 'mysql'
  # PostgreSQL
  brew 'postgresql'
  cask 'datagrip'

  ## Key-Value DB
  # Persistent key-value database, with built-in net interface
  brew 'redis'

  ## Messaging Queue
  # Publish-subscribe messaging rethought as a distributed commit log
  brew 'kafka'
  # Generic command-line non-JVM Apache Kafka producer and consumer
  brew 'kafkacat'
### }}}
