jorgebucaran/fisher
IlanCosman/tide@v5
franciscolourenco/done
jorgebucaran/replay.fish
edc/bass
patrickf1/colored_man_pages.fish
jethrokuan/z
jorgebucaran/nvm.fish
oh-my-fish/plugin-aws
evanlucas/fish-kubectl-completions
jethrokuan/fzf
pure-fish/pure
